{
  "activation_function": "tanh",
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "attn_pdrop": 0.16469325333835552,
  "bos_token_id": 5,
  "embd_pdrop": 0.19380366539807364,
  "eos_token_id": 6,
  "initializer_range": 0.04773452438247231,
  "layer_norm_epsilon": 7.183655237149971e-06,
  "model_type": "gpt2",
  "n_embd": 864,
  "n_head": 16,
  "n_inner": null,
  "n_layer": 6,
  "n_positions": 512,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.07594191919929022,
  "scale_attn_by_inverse_layer_idx": true,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.0",
  "use_cache": true,
  "vocab_size": 89
}
